webapi/soap/test

HTTP/1.0 200 OK
Cache-Control: private, max-age=0
Content-Length: 511
Content-Type: text/xml; charset=utf-8
Server: Microsoft-IIS/7.0
X-AspNet-Version: 4.0.30319
X-Powered-By: ASP.NET
Date: Thu, 18 Aug 2011 23:10:38 GMT
X-Cache: MISS from groovy
Proxy-Connection: keep-alive
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body>
<GetGeoIPResponse xmlns="http://www.webservicex.net/">
<GetGeoIPResult>
<ReturnCode>1</ReturnCode><IP>192.168.1.147</IP><ReturnCodeDetails>Success</ReturnCodeDetails><CountryName>Reserved</CountryName><CountryCode>ZZZ</CountryCode></GetGeoIPResult></GetGeoIPResponse></soap:Body></soap:Envelope>

POST http://www.webservicex.net/geoipservice.asmx HTTP/1.1
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 2.0.50727.3623)
VsDebuggerCausalityData: uIDPo6gzadELA05Nqbs7rbnlNfsAAAAAobI/IVbc3kqHpx1smD/8eyAoKrOyTnJOtce5F0YeogEACQAA
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://www.webservicex.net/GetGeoIP"
Host: www.webservicex.net
Content-Length: 339
Expect: 100-continue
Proxy-Connection: Keep-Alive
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://www.webservicex.net/GetGeoIP"
Host: www.webservicex.net
Content-Length: 339
Expect: 100-continue
Proxy-Connection: Keep-Alive
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetGeoIP xmlns="http://www.webservicex.net/"><IPAddress>192.168.1.147</IPAddress></GetGeoIP></soap:Body></soap:Envelope>
